#### https://www.wintellect.com/using-pandas-to-analyze-sales-data/

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:/Users/fshok/Documents/temp/OfficeSupplies.csv")
df.shape

(43, 6)

In [3]:
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

In [4]:
df.dtypes

OrderDate      object
Region         object
Rep            object
Item           object
Units           int64
Unit Price    float64
dtype: object

In [5]:
df.describe()

           Units  Unit Price
count  43.000000   43.000000
mean   49.325581   20.308605
std    30.078248   47.345118
min     2.000000    1.290000
25%    27.500000    3.990000
50%    53.000000    4.990000
75%    74.500000   17.990000
max    96.000000  275.000000

In [6]:
df.isnull().values.any()

False

In [7]:
df.groupby(["Rep"]).sum().sort_values("Units", ascending=False)

         Units  Unit Price
Rep
Richard    396       55.92
Alex       281       39.95
Bill       213       40.55
Matthew    193      173.93
Rachel     183       10.26
Morgan     173       26.47
Susan      170       55.97
Smith      156      141.29
James      142      299.97
Nick       125        6.98
Thomas      89       21.98

In [8]:
df["Total Price"] = df["Units"] * df["Unit Price"]
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price  Total Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99       309.38
1  12-Jul-2014     East     Nick   Binder     29        1.99        57.71
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49       686.95
3  29-Jul-2014     East    Susan   Binder     81       19.99      1619.19
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95      1005.90

In [9]:
df.groupby("Rep").sum().sort_values("Total Price", ascending=False).head()

         Units  Unit Price  Total Price
Rep
Matthew    193      173.93      3109.44
Susan      170       55.97      3102.30
Alex       281       39.95      2812.19
Richard    396       55.92      2363.04
Bill       213       40.55      1749.87

In [10]:
group = df.groupby(["Region","Rep"]).sum()
total_price = group["Total Price"].groupby(level=0, group_keys=False)
total_price.nlargest(5)

Region   Rep
Central  Matthew    3109.44
         Alex       2812.19
         Bill       1749.87
         Smith      1641.43
         Morgan     1387.77
East     Susan      3102.30
         Richard    2363.04
         Nick        536.75
West     James      1283.61
         Thomas     1203.11
Name: Total Price, dtype: float64